{
  "recipes": [
    {
      "id": 200,
      "name": "Mini sausage rolls",
      "url": "https://www.bbcgoodfood.com/recipes/12541/mini-sausage-rolls",
      "description": "I made this last year at Christmas and they went down a treat & will repeat this year too. I added some chorizo sausagemeat in with the regular sausage meat and they were so yummy!! Going to also make a batch this year with gluten-free puff pastry.",
      "author": "John Torode",
      "ingredients": [
        ".5 small garlic clove",
        "handful parsley, chopped",
        "400g pack sausagemeator sausages",
        "375g pack ready-rolled puff pastry",
        "1 beaten egg, to glaze"
      ],
      "steps": [
        "Heat oven to 200C/fan 180C/gas 6.",
        "Crush .5 small garlic clove and a little salt to a paste using a pestle and mortar, or use the flat of your knife on a chopping board. Mix together with a handful of chopped parsley and stir in 50ml cold water.",
        "Place 400g sausagemeat in a food processor (if using sausages, peel away the skins), turn on to a high speed, pour the garlic-flavoured water into the mixture, then season with pepper.",
        "Unroll 375g ready-rolled puff pastry onto a board and cut in half lengthways.",
        "Divide the sausage mixture in two and spread along the length of each pastry strip in a cylinder shape, leaving a 1cm edge.",
        "Tightly roll the pastry around the sausagemeat and brush the ends with 1 beaten egg to secure.",
        "Use a sharp knife to cut each roll into 10 pieces, each about 2.5cm long, and place on a baking sheet.",
        "Can be made up to this point 1 month in advance and frozen. To cook from frozen, simply add 10 mins to cooking time below.",
        "Brush more beaten egg all over the pastry. Place in the oven and cook for 25-35 mins until the pastry is puffed and crisp and the meat has cooked through. Remove and eat hot or cold with tomato ketchup if you like."
      ],
      "favorite": true
    },
    {
      "id": 201,
      "name": "Snow globe hot chocolate",
      "url": "https://www.bbcgoodfood.com/recipes/snow-globe-hot-chocolate",
      "description": "Marshmallows and strawberry laces transform into a snowman in this cute edible gift idea - a hot chocolate kit in a jam jar - perfect family fun",
      "author": "Good Food",
      "ingredients": [
        "3 large white marshmallows",
        "icingpens, in black and orange",
        "1 giant chocolate button",
        "1 chocolate- a mini Reese's peanut butter cup or other domed chocolate is perfect",
        "2 tbsp cocoa powder",
        "2 tbsp Horlickspowder",
        "handful mini white marshmallows",
        "1 cookie(small enough to fit in a jam jar)",
        "3 strawberrieslaces",
        "1 cocktail stick",
        "1 large jam jar",
        "ribbonand gift tag"
      ],
      "steps": [
        "First make the marshmallow snowman. Skewer the marshmallows together with a cocktail stick - cut off any of the stick that protrudes from the top. Use a little of the icing pen to stick a chocolate button and peanut butter cup to the top of each marshmallow stack, then draw on a face and 3 dots for buttons. Plait 3 strawberry laces and tie around the neck for a scarf. Stick the snowman to a cookie with a little more icing, then set aside to dry for a few mins.",
        "Mix the cocoa and Horlicks together in the bottom of your jar. Put the snowman on top, then scatter around the mini marshmallows. Screw on the lid, tie with a ribbon and a gift tag with the following instructions: Warm 300ml milk in a pan. Remove the snowman from the jar and add the milk. Stir until smooth and chocolatey, then enjoy, with your marshmallow snowman for dunking."
      ]
    },
    {
      "id": 202,
      "name": "Stollen mince pies",
      "url": "https://www.bbcgoodfood.com/recipes/2760971/stollen-mince-pies",
      "description": "These are delicious! Pretty easy to make but just need a bit more preparation . I make mine to the size in the recipe but bake in a deep tray really for muffins. The cakey stollen mixture spreads out and sits neatly atop the mince pie bit which looks good. I have put chopped pistachios on top prior to the bake ... this works well ... or put dried cranberries and/or juicy yellow raisins in the cake mixture as well as marzipan but they will burn if you just put them on top. I have also put lemon zest on top of the blob of mincemeat .. also nice :)",
      "author": "Good Food",
      "ingredients": [
        "375g pack sweet shortcrust pastry",
        "a little flour, for dusting",
        "375g mincemeat",
        "50g madeira cake",
        "50g ground almond",
        "25g caster sugar",
        "50g butter, softened",
        "1 egg yolk",
        "3 tbsp candied peel",
        "100g marzipan, finely diced",
        "25g toasted flaked almond",
        "icing sugar, for dusting"
      ],
      "steps": [
        "Roll out the pastry on a lightly floured surface and stamp out 12 roughly 8cm circles you might need to re-roll the trimmings. Press into the holes of a 12-hole bun tin. Add a few tsp of the mincemeat to each pastry case.",
        "Whizz the cake, ground almonds, caster sugar, butter and egg in a food processor until smooth. Transfer to a bowl, then stir in the candied peel and marzipan. Divide between the tarts and scatter over the flaked almonds. You can cover and chill the unbaked tarts for up to a day, or freeze for up to 3 months.",
        "Heat oven to 200C/180C fan/gas 6. Bake the pies for 20-25 mins until golden. Remove from the oven and dust with icing sugar. When cool enough, lift from the tin."
      ],
      "favorite": true
    },
    {
      "id": 203,
      "name": "Macadamia & cranberry American cookies",
      "url": "https://www.bbcgoodfood.com/recipes/13387/macadamia-and-cranberry-american-cookies",
      "description": "These freezable biscuits are completely irresistible and make a great gift for kids to give to teachers or grandparents",
      "author": "Sara Buenfeld",
      "ingredients": [
        "3 x 200g/7oz white chocolatebars, chopped",
        "200g butter",
        "2 eggs",
        "100g light muscovado sugar",
        "175g golden caster sugar",
        "2 tsp vanilla extract",
        "350g plain flour",
        "2 tsp baking powder",
        "1 tsp cinnamon",
        "100g dried cranberry",
        "100g macadamia nut, chopped"
      ],
      "steps": [
        "Heat oven to 180C/160C fan/gas 4. Melt 170g of the chocolate, then allow to cool. Beat in the butter, eggs, sugars and vanilla, preferably with an electric hand whisk, until creamy. Stir in the flour, baking powder, cinnamon and cranberries with two-thirds of the remaining chocolate and macadamias, to make a stiff dough.",
        "Using a tablespoon measure or a small ice-cream scoop, drop small mounds onto a large baking dish, spacing them well apart, then poke in the reserved chocolate, nuts and berries. Bake in batches for 12 mins until pale golden, leave to harden for 1-2 mins, then cool on a wire rack.",
        "To freeze, open-freeze the raw cookie dough scoops on baking trays; when solid, pack them into a freezer container, interleaving the layers with baking parchment. Use within 3 months. Bake from frozen for 15-20 mins."
      ],
      "favorite": true
    },
    {
      "id": 204,
      "name": "Chocolate orange & cranberry red velvet bombe",
      "url": "https://www.bbcgoodfood.com/recipes/chocolate-orange-cranberry-red-velvet-bombe",
      "description": "This stunning festive dessert makes a great alternative to Christmas pudding, with a hidden cream cheese and cranberry filling",
      "author": "Cassie Best",
      "ingredients": [
        "175g butter, very soft, plus extra for greasing",
        "200g plain flour, plus extra for dusting",
        "200g golden caster sugar",
        "4 large eggs",
        "2 tbsp cocoa",
        "1 tsp bicarbonate of soda",
        "1.5 tsp baking powder",
        "75g buttermilk",
        "2 tsp vanilla extract",
        "2 x 10g tubes red food colouring(make sure it's a bake-safe variety we used Dr. Oetker)",
        "2 tbsp white wine vinegar",
        "450ml double cream",
        "zest 2 oranges",
        "100g bar white chocolate, finely chopped",
        "100g bar dark chocolate, finely chopped",
        "200g bar milk chocolate, finely chopped",
        "180g tub cream cheese",
        "3 tbsp icing sugar",
        "50g dried cranberries, plus extra to serve",
        "sprinklesand edible glitter (optional), to decorate"
      ],
      "steps": [
        "Heat oven to 160C/140C fan/gas 3. Grease 2 x 16cm hemisphere cake tins, then dust with flour and shake out the excess. Stand the tins on two ramekins placed on a baking tray to hold them steady. Put the cake ingredients in a large mixing bowl, add a pinch of salt and whisk together until smooth and evenly coloured bright red. Divide the mixture between the two tins and bake for 45 mins. Remove from the oven, cool in the tins for 10 mins, then tip onto a wire rack and leave until completely cold.",
        "Meanwhile, make the chocolate-orange ganache and the filling. Pour the cream into a saucepan, add the orange zest and heat until just steaming. Put half the white chocolate in a bowl, and the dark and milk chocolates in another bowl. Pour 50ml of the hot cream over the white chocolate (strain it if the orange zest is in big strands), and the remaining cream over the dark and milk mixture. Leave the bowls for 1-2 mins, then stir until smooth and glossy. Set aside to cool for 10 mins.",
        "Put the cream cheese in a bowl and whisk lightly to loosen. Add the icing sugar and the cooled white chocolate and cream mixture, then blend until smooth. Stir through the cranberries, then chill.",
        "When the cakes are cold, you can start assembling. With the cakes flat-side up, use a 7cm biscuit cutter to mark a circle in the centre of each. Use a spoon to gently scoop a dip in each cake, about 4cm deep (save the crumbs for cake truffles see tip, left.) Remove the cream cheese mixture from the fridge and use to fill the cavities in the cakes, spreading a little onto the flat surfaces too, to help them stick together. Invert 1 cake onto the other to create a sphere, and place on a wire rack set over a baking tray (this will catch any chocolate drips).",
        "To ice the cake, the chocolate ganache needs to be the right consistency pourable but not too runny. If it has set a little too much, place in the microwave for 10-20 secs, then mix until smooth; if it is too runny, chill until it has firmed up a little. Pour half the ganache over the cake, letting it cover the sides and run into the tray below (use the chocolate drips for cake truffles, see Tip). Cover the whole surface using a palette knife. This is just the first coating, so won't fill the gap between the sponges. Chill the cake for 20 mins or until the ganache has firmed up a little.",
        "Remove the cake from the fridge. Cover the gap around the middle with the remaining ganache, smoothing it all over with a palette knife. Return to the fridge for another 20 mins until firm, then transfer to a serving plate.",
        "Melt the remaining white chocolate in the microwave in short 10-sec bursts. Drizzle over the top of the cake, then scatter with dried cranberries, sprinkles and edible glitter, if you like. Chill if not serving straight away it will keep in the fridge for up to 2 days. Remove from the fridge 30 mins before serving."
      ],
      "favorite": true
    },
    {
      "id": 205,
      "name": "Persian cranberry sauce",
      "url": "https://www.bbcgoodfood.com/recipes/persian-cranberry-sauce",
      "description": "Middle Eastern flavours of pomegranate molasses and orange zest bring a new dimension to traditional cranberry sauce, with a thick and chunky texture",
      "author": "Good Food",
      "ingredients": [
        "250g fresh or frozen cranberries",
        "2 tbsp pomegranate molassesor balsamic vinegar",
        "juice and finely grated zest .5 orange, plus extra zest to serve",
        "2 tbsp golden caster sugar, plus extra to taste",
        "pinch of ground allspice"
      ],
      "steps": [
        "Tip all the ingredients into a small saucepan and bring to a gentle simmer. Stir over a low heat for 10 mins until the cranberries have burst into a thick, glossy, sticky sauce. We like ours on the sour side to give your plate a hit of acidity, but if you prefer it sweeter add a bit more sugar. Leave the sauce to cool, then sprinkle over a little orange zest to serve. Can be kept covered in the fridge for up to a week, or frozen for 4 months."
      ],
      "favorite": true
    },
    {
      "id": 206,
      "name": "Chocolate mint loaf cake",
      "url": "https://www.bbcgoodfood.com/recipes/chocolate-mint-loaf-cake",
      "description": "Bring some contemporary glamour to your table with this layered sponge flavoured with After Eight icing and peppermint",
      "author": "Sarah Cook",
      "ingredients": [
        "2 x 85g salted butter, plus extra for greasing",
        "2 x 50g dark chocolate, broken into pieces",
        "2 x 120g plain flour",
        "2 x 140 golden caster sugar",
        "6 tbsp cocoa",
        "1 tsp bicarbonate of soda",
        "2 large eggs",
        "284ml carton buttermilk",
        "300g box After Eights, broken",
        "50ml double cream",
        "turquoise food colouring",
        "300g Regal-Ice Ready to Roll icing",
        "1 tsp peppermintextract"
      ],
      "steps": [
        "Heat oven to 180C/160C fan/gas 4. Grease and line the base and sides of a 22cm square tin. Melt 85g butter and 50g chocolate together in a small pan. Mix 120g flour, 140g sugar, 3 tbsp of the cocoa and .5 tsp bicarbonate in a bowl.",
        "Whisk together 1 egg with half the buttermilk (about 140ml). Scrape the melted chocolate mixture and egg mixture into the dry ingredients, along with 100ml boiling water. Whizz briefly with an electric whisk until lump-free. Scrape into the tin and bake for 18-20 mins until a skewer comes out clean.",
        "Cool the cake in the tin for 15 mins, then transfer to a wire rack to finish cooling while you repeat steps 1 and 2 to make a second cake. Cool both completely.",
        "To make the icing, melt the After Eights and cream together in a saucepan. Cool, then chill until spreadable.",
        "Trim the cake edges, then halve to make 4 rectangles. Use half of the icing to sandwich the layers together, then spread the rest over the top and sides. Chill.",
        "Knead some colouring into the ready-to-roll icing with the peppermint extract. Roll out on an icing sugar dusted surface, then lift over to cover the cake, smoothing with your hands. Trim excess icing, then scatter with decorations.",
        "Chill again for 1 hr to firm up, then serve or keep in the fridge, removing 30 mins before serving."
      ],
      "favorite": true
    },
    {
      "id": 207,
      "name": "Chestnut stuffing roll",
      "url": "https://www.bbcgoodfood.com/recipes/2744665/chestnut-stuffing-roll",
      "description": "Try a new presentation style - this nutty, bacon-wrapped log is designed to save space in the oven. Serve in thick slices",
      "author": "Good Food",
      "ingredients": [
        "1 tbsp butter",
        "3 onions, chopped",
        "15g pack sage, shredded",
        "200g pack cooked chestnut",
        "100g hazelnut",
        "100g breadcrumb",
        ".5 tsp mace",
        "2 large eggs, beaten",
        "2 tbsp butter, plus extra to serve",
        "15 rashers streaky bacon",
        "few sageleaves, to serve (optional)"
      ],
      "steps": [
        "To make the stuffing, melt the butter in a large non-stick pan, add the onions and gently cook for 10-15 mins until very soft. Stir in the sage for 1 min, then tip into a large mixing bowl. Pulse the chestnuts in a food processor until chopped into small bits, then tip these into the bowl with the onions and repeat with the hazelnuts. Add the breadcrumbs, mace, beaten egg, 1 tsp salt and some pepper, and mix everything together well.",
        "Tear off a very large sheet of foil. Smear the butter in the middle, making a rectangle about 30 x 40cm. Lay the bacon rashers over in a row, overlapping a little. Use a rolling pin to slowly but firmly roll down the length of the bacon strips to stretch them a bit. Shape the stuffing into a log along the rashers. Using the foil to help you, roll up the stuffing so that it is completely wrapped in the bacon. Overwrap with the extra foil and twist the ends to tighten and seal. If it's not very round, give it an extra roll or two on your work surface. Chill until ready to roast. ",
        ".",
        "To cook, bake at 200C/180C fan/gas 6 (when you turn up the heat for the turkey) for 30 mins. When the turkey comes out, turn up the heat to 220C/200C fan/gas 7, unwrap the stuffing and continue to cook for 30 mins more until crisp. Keep warm, then slice and serve with sage leaves fried in butter, if you like."
      ]
    },
    {
      "id": 208,
      "name": "Melty cheese fondue pot",
      "url": "https://www.bbcgoodfood.com/recipes/melty-cheese-fondue-pot",
      "description": "Made this for two by halving ingredients and baking in individual dishes. Absolutely lovely either as starter or cheese course with a difference and dead easy to boot!",
      "author": "Cassie Best",
      "ingredients": [
        "200g brie, rind removed, roughly chopped",
        "100g cream cheese(not light versions)",
        "100g gruyere, rind removed, grated",
        "2 tbsp grated parmesan(or vegetarian alternative)",
        "2 tbsp milk",
        "2 tsp cornflour",
        "few thyme sprigs, leaves picked and roughly chopped",
        "100g caramelised onion chutney",
        "crusty bread, to serve"
      ],
      "steps": [
        "Put the brie, cream cheese, gruyere, half the parmesan, the milk and cornflour into a food processor, and blitz until smooth. Stir through the thyme and a little black pepper. Spoon the chutney into an ovenproof baking dish (ours was 15cm round) and spread it over the base. Top with the cheese mixture, spread to cover the chutney, then scatter over the remaining parmesan. It can now be covered with cling film and chilled for up to 3 days.",
        "Heat oven to 160C/140C fan/gas 3. Put the baking dish on a baking tray and cook for 25 mins until bubbling. Turn the grill to a medium-high setting and grill for 2-3 mins or until golden brown and crispy on top. Remove from the oven and leave to cool for 5 mins before serving with crusty bread for dunking."
      ]
    },
    {
      "id": 209,
      "name": "Chorizo jam",
      "url": "https://www.bbcgoodfood.com/recipes/chorizo-jam",
      "description": "I made this for my partner's family at Christmas and it went down a treat. It is lovely with crackers. Highly recommended.",
      "author": "Good Food",
      "ingredients": [
        "500g cooking chorizo, diced",
        "1 large white onion, finely sliced",
        "2 garlic cloves, crushed",
        "85g light muscovado sugar",
        "3 tbsp Sherry or red wine vinegar",
        "2 tbsp maple syrup",
        "1 shot of espressocoffee or 100ml/4fl oz strong black coffee"
      ],
      "steps": [
        "Fry the chorizo in a large saucepan for about 5 mins until golden and crispy at the edges. Remove the chorizo with a slotted spoon and transfer to a plate, leaving the oil that has been released in the pan.",
        "Turn the heat down low and gently cook the onion in the chorizo oil for 15-20 mins or until very soft and starting to brown. Stir in the garlic, muscovado sugar, Sherry, maple syrup, espresso and chorizo.",
        "Cook slowly for 35-40 mins, stirring occasionally, until thick and syrupy. Turn off the heat, leave to cool a little, then tip everything into a food processor. Pulse briefly to chop everything up into really small pieces, then leave the mixture to cool before packing it into 2 sterilised jam jars. Will keep for up to 1 month in the fridge."
      ]
    },
    {
      "id": 210,
      "name": "Parsnip, cranberry & chestnut loaf",
      "url": "https://www.bbcgoodfood.com/recipes/69605/parsnip-cranberry-and-chestnut-loaf",
      "description": "A modern take on the nut loaf, this makes a great vegetarian centrepiece for Christmas Day or a special dinner",
      "author": "Sarah Cook",
      "ingredients": [
        "4 tbsp butter, plus a little extra for greasing",
        "3 onions, chopped",
        "15g pack sage, 6 leaves reserved, rest shredded",
        "200g pack cooked chestnut",
        "100g walnut",
        "100g breadcrumb",
        ".5 tsp mace",
        "1 egg, beaten",
        "500g cranberry",
        "175g caster sugar",
        "550g parsnip, choose long, thin ones if you can, peeled then halved lengthways",
        "1 tbsp honey"
      ],
      "steps": [
        "Melt 1 tbsp butter in a large non-stick pan, add the onions and gently cook for 10-15 mins until very soft. Stir in the sage for 1 min, then tip into a large mixing bowl. Pulse the chestnuts in a food processor until chopped into small bits, then tip these into the bowl with the onions and repeat with the walnuts. Now add the breadcrumbs, mace, beaten egg, 1 tsp salt and some pepper and mix everything together well.",
        "Tip the cranberries and sugar into a pan and simmer for about 8-10 mins over a high heat. The sugar will melt and cranberries will pop and become saucy keep bubbling until sticky. Set aside to cool. Grease a 900g loaf tin, line with a long strip of baking parchment that covers the bottom and two ends, then grease this as well.",
        "Bring a large pan of salted water to the boil. Throw in the parsnips and boil for 3.5 mins. Drain well. From the thinner ends, cut off lengths of parsnip that fit widthways across the bottom of your loaf tin. Keep going until you have enough to snugly line the base of the tin. Roughly chop all leftover parsnip and mix into the nut mixture.",
        "Heat oven to 180C/160C fan/gas 4. Mix the parsnip lengths with 1 more tbsp butter and the honey to coat, then fit them into the tin. Top with ¹/³ of the nut mixture pack it down well and smooth the surface. Spread ¹/³ of the cranberry sauce on top, leaving a small gap around the edges. Top with the remaining nut mixture and pack down as before. The loaf can be made up to 24 hrs ahead, then covered and chilled, before continuing. Cover with foil then bake for 1 hr.",
        "To serve, melt the remaining 2 tbsp butter in a small pan and sizzle the reserved sage leaves for a minute. Splash water into the remaining cooked cranberries until saucy. Loosen around the sides of the loaf with a round-bladed knife if you need, then turn out. Drizzle with the sage butter and leaves. Serve in slices with extra cranberry sauce."
      ]
    }
  ]
}
